app/Http/Controllers/PostController.php

    public function index(Request $request)
    {
        if ($request->search){
            $posts = Post::join('users', 'author_id', '=', 'users.user_id')
                ->where('title', 'like', '%'.$request->search.'%')
                ->orWhere('descr', 'like', '%'.$request->search.'%')
                ->orWhere('name', 'like', '%'.$request->search.'%')
                ->orderBy('posts.created_at', 'desc')
                ->get();
            return view('posts.index', compact('posts'));
        }

        $posts = Post::join('users', 'author_id', '=', 'users.user_id')
            ->orderBy('posts.created_at', 'desc')
            ->paginate(4);
---
select * from `posts` inner join `users` on `author_id` = `users`.`user_id` where `title` like '%P%' or `descr` like '%P%' or `name` like '%P%' order by `posts`.`created_at` desc
select * from `posts` inner join `users` on `author_id` = `users`.`user_id` order by `posts`.`created_at` desc limit 4 offset 0
select count(*) as aggregate from `posts` inner join `users` on `author_id` = `users`.`user_id`

    public function store(Request $request)
    {
        $post = new Post();
        $post->title = $request->title;
        $post->short_title = Str::length($request->title)>30 ? Str::substr($request->title, 0, 30) . '...' : $request->title;
        $post->descr= $request->descr;
        $post->author_id= rand(1, 4);
        if($request->file('img')){
            $path = \Storage::putFile('public', $request->file('img'));
            $url = \Storage::url($path);
            $post->img= $url;
        }

        $post->save();
---
insert into `posts` (`title`, `short_title`, `descr`, `author_id`, `img`, `updated_at`, `created_at`) values ('Создать пост 4', 'Создать пост 4', 'Добавляю текст для поста 4', 2, '/storage/alLWzXKsfM3sQiGp52xJD4jfoMCZPzecSQLJRBpI.jpeg', '2020-03-21 15:26:20', '2020-03-21 15:26:20')

    public function show($id)
    {
        $post = Post::join('users', 'author_id', '=', 'users.user_id')
            ->find($id);
---
select * from `posts` inner join `users` on `author_id` = `users`.`user_id` where `posts`.`post_id` in (24, 2, 'Пост номер один', 'Пост номер один', '/storage/3cJfsw1VmnZ1ZPMfs0FAFTkWmqBbaT1d8gb5v9EB.jpeg', 'Текст поста номер один', '2020-03-20T15:21:47.000000Z', '2020-03-20T15:21:47.000000Z')

    public function destroy($id)
    {
        $post = Post::find($id);
        $post->delete();
---
delete from `posts` where `post_id` = 25